<?php
/**
 * Видоизмените выполнение задания в предыдущем упражнении таким образом, чтобы строки
 * в результирующей таблице были упорядочены сначала по населению, а затем по названиям
 * городов.
 */
$cities = [ "Нью-Йорк" => ["", 8175133],
            "Лос-Анджелес" => ["шт. Калифорния", 3792621],
            "Чикаго" => ["шт. Иллинойс", 2695598],
            "Хьюстон" => ["шт. Иллинойс",  2695598],
            "Филадельфия" => ["шт. Техас", 2100263],
            "Феникс" => ["шт. Аризона", 1445632],
            "Сан-Антонио" => ["шт. Техас", 1327407],
            "Сан-Диего" => ["шт. Калифорния", 1307402],
            "Даллас" => ["шт. Техас", 1197816],
            "Сан-Хосе" => ["шт. Калифорния", 945942] ];
ksort($cities);
foreach ($cities as $city => $info) {
    $state = $info[0];
    $population = $info[1];
    printf("<pre>%s | %s | %s</pre>", $city, $state, $population);
}
function cmp($a, $b)
{
    return $a[1] - $b[1];
}
uasort($cities, 'cmp');
foreach ($cities as $city => $info) {
    $state = $info[0];
    $population = $info[1];
    printf("<pre>%s | %s | %s</pre>", $city, $state, $population);
}
?>